# -*- mode: org -*-
# -*- coding: utf-8 -*-

# ==============================================================================
# author          :Ghislain Vieilledent
# email           :ghislain.vieilledent@cirad.fr, ghislainv@gmail.com
# web             :https://ecology.ghislainv.fr
# license         :GPLv3
# ==============================================================================

#+TITLE: Spatial scenario of tropical deforestation and carbon emissions for the 21^{st} century
#+AUTHOR: @@latex:Ghislain Vieilledent$^{\star, 1, 2, 3}$ \and Christelle Vancutsem$^{1}$ \and Clément Bourgoin$^{1}$ \and Pierre Ploton$^{2}$ \and Philippe Verley$^{2}$ \and Frédéric Achard$^{1}$@@

#+OPTIONS: H:2 toc:nil title:t author:t ^:{} num:t date:nil
#+TAGS: export(e) noexport(n) ignore(i)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+LANGUAGE: en
#+LATEX_CLASS: koma-article
#+LATEX_CLASS_OPTIONS: [paper=a4, 12pt, DIV=12, english, dvipsnames]

#+LATEX_HEADER: \usepackage{amsfonts}
#+LATEX_HEADER: \usepackage{bookmark}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{myblue}{RGB}{0,101,165}
#+LATEX_HEADER: \hypersetup{colorlinks=true, allcolors=myblue}
#+LATEX_HEADER: \definecolor{bg}{rgb}{0.95,0.95,0.95}
#+LATEX_HEADER: \definecolor{darkgreen}{RGB}{0,150,0}
#+LATEX_HEADER: \usepackage{longtable}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \addtokomafont{title}{\color{myblue}}
#+LATEX_HEADER: \usepackage[modulo]{lineno}
# https://tex.stackexchange.com/questions/135747/problem-with-and-within-hypersetuppdfauthor
#+LATEX_HEADER: \pdfstringdefDisableCommands{\def\and{and }}
# Caption with KOMA
#+LATEX_HEADER: \setcapindent{0em}
# #+LATEX_HEADER: \usepackage[numbers,sort&compress,merge,round]{natbib}

#+LINK: FARmaps https://forestatrisk.cirad.fr/maps.html
#+LINK: SI https://forestatrisk.cirad.fr/article/Vieilledent2023-preprint-SI.pdf

*** Computations                                                   :ignore:

#+NAME: val-forest-summary
#+begin_src R :results output raw :exports none
df_mean <- read_csv(here("Analysis", "jrc2020", "fcc_proj_region_mean.csv")) %>% mutate(sim="mean")
df_min <- read_csv(here("Analysis", "jrc2020", "fcc_proj_region_min.csv")) %>% mutate(sim="min")
df_max <- read_csv(here("Analysis", "jrc2020", "fcc_proj_region_max.csv")) %>% mutate(sim="max")
df <- df_mean %>%
  dplyr::bind_rows(df_min, df_max) %>%
  dplyr::filter(cont %in% c("America", "Africa", "Asia", "All continents")) %>%
  dplyr::arrange(factor(cont, levels=c("America", "Africa", "Asia", "All continents")),
                 factor(sim, levels=c("min", "mean", "max")))
ascii(df, include.rownames=FALSE)
#+end_src

#+RESULTS: val-forest-summary
| cont           |       for2040 |      for2050 |      for2060 |      for2080 |      for2100 | loss21 | yr75dis | sim  |
|----------------+---------------+--------------+--------------+--------------+--------------+--------+---------+------|
| America        |  584507063.00 | 566146083.00 | 547785103.00 | 511158049.00 | 476194554.00 |  30.72 | 2290.00 | min  |
| America        |  570321329.00 | 544868629.00 | 519771908.00 | 472135034.00 | 427790430.00 |  37.76 | 2220.00 | mean |
| America        |  556137349.00 | 524373221.00 | 493634588.00 | 436104701.00 | 380806412.00 |  44.60 | 2180.00 | max  |
| Africa         |  213363385.00 | 201250184.00 | 190556925.00 | 169961031.00 | 151415462.00 |  44.94 | 2207.00 | min  |
| Africa         |  203301975.00 | 188403221.00 | 174981784.00 | 150357327.00 | 129045039.00 |  53.07 | 2163.00 | mean |
| Africa         |  194678891.00 | 177631287.00 | 161825790.00 | 134768399.00 | 110050172.00 |  59.98 | 2136.00 | max  |
| Asia           |  220609173.00 | 206896233.00 | 193590998.00 | 167745718.00 | 142358155.00 |  52.08 | 2166.00 | min  |
| Asia           |  207998993.00 | 188558188.00 | 169650398.00 | 132402725.00 |  98921850.00 |  66.70 | 2117.00 | mean |
| Asia           |  195495638.00 | 170602678.00 | 146054665.00 |  99688530.00 |  62898467.00 |  78.83 | 2093.00 | max  |
| All continents | 1018479621.00 | 974292500.00 | 931933026.00 | 848864798.00 | 769968171.00 |  38.86 | 2256.00 | min  |
| All continents |  981622297.00 | 921830038.00 | 864404090.00 | 754895086.00 | 655757319.00 |  47.93 | 2192.00 | mean |
| All continents |  946311878.00 | 872607186.00 | 801515043.00 | 670561630.00 | 553755051.00 |  56.03 | 2157.00 | max  |

#+NAME: yr75-uncertainty
#+begin_src R :results output :exports none
Mean <- df %>% dplyr::filter(sim == "mean") %>% select(yr75dis)
Min <- df %>% dplyr::filter(sim == "min") %>% select(yr75dis)
Max <- df %>% dplyr::filter(sim == "max") %>% select(yr75dis)
Uncertainty <- round(mean(unlist(cbind(Min-Mean, Mean-Max))))
print(glue("yr-uncertainty: +/-{Uncertainty} yr"))
#+end_src

#+RESULTS: yr75-uncertainty
: yr-uncertainty: +/-44 yr

#+NAME: val-C-summary
#+begin_src R :results output raw :exports none
df <- read_csv(here("Analysis", "jrc2020", "C_trend_mean_cci.csv"))
ascii(df, include.rownames=FALSE, digits=3)
#+end_src

#+RESULTS: val-C-summary
| area_cont      | T10_20 | T20_30 | T30_40 | T40_50 | T50_60 | T60_70 | T70_80 | T80_90 | T90_100 | T100_110 |
|----------------+--------+--------+--------+--------+--------+--------+--------+--------+---------+----------|
| Africa         |  0.129 |  0.150 |  0.164 |  0.154 |  0.148 |  0.148 |  0.151 |  0.149 |   0.149 |    0.146 |
| America        |  0.206 |  0.247 |  0.250 |  0.259 |  0.268 |  0.272 |  0.274 |  0.275 |   0.283 |    0.288 |
| Asia           |  0.096 |  0.107 |  0.119 |  0.128 |  0.135 |  0.146 |  0.156 |  0.156 |   0.159 |    0.155 |
| All continents |  0.432 |  0.504 |  0.533 |  0.541 |  0.551 |  0.566 |  0.581 |  0.581 |   0.590 |    0.589 |

#+NAME: trend-C-summary
#+begin_src R :results output :exports none
Max <- max(df[df$area_cont == "All continents", c(-1)])
Min <- min(df[df$area_cont == "All continents", c(-1)])
diff <- round(Max - Min, 3)
inc <- round(100 * (Max - Min) / Min)
print(glue("Min (Pg/yr): {round(Min, 3)}, Max (Pg/yr): {round(Max, 3)}, Diff (Pg/yr): {diff}, Inc (%): {inc}"))
#+end_src

#+RESULTS: trend-C-summary
: Min (Pg/yr): 0.432, Max (Pg/yr): 0.59, Diff (Pg/yr): 0.159, Inc (%): 37

*** Computations                                                   :ignore:

#+begin_src R :results output raw :exports none
df <- read_csv(here("Analysis/jrc2020/sign_PA_road.csv"))
ascii(df)
#+end_src

#+RESULTS:
|   | var  |  nctry | nctry_sign |  perc | perc_w |
|---+------+--------+------------+-------+--------|
| 1 | PA   | 119.00 |      70.00 | 59.00 |  88.00 |
| 2 | road | 119.00 |      61.00 | 51.00 |  90.00 |

#+begin_src R :results output raw :exports none
df <- read_csv(here("Analysis/jrc2020/parea_estimates.csv"))
df_wmean <- df %>%
  dplyr::mutate(P=ifelse(is.na(Mean), 0, P)) %>%
  dplyr::summarise(n=n(), mean=mean(P), sd=sd(P), min=min(P), max=max(P), wmean=weighted.mean(P, for2010))
d_pa <- round(df_wmean$wmean)
ascii(df_wmean)
#+end_src

#+RESULTS:
|   |      n |  mean |    sd |  min |   max | wmean |
|---+--------+-------+-------+------+-------+-------|
| 1 | 119.00 | 18.90 | 19.83 | 0.00 | 82.00 | 34.17 |

#+begin_src R :results output :session *R* :exports none
print(glue("PAs reduce deforestation by {d_pa}%."))
#+end_src

#+RESULTS:
: PAs reduce deforestation by 34%.

#+begin_src R :results output raw :exports none
df <- read_csv(here("Analysis/jrc2020/parea_estimates.csv"))
fcc_tab <- read_csv(here("Analysis/jrc2020/forest_cover_change_mean.csv"))
df_sign <- df %>%
  dplyr::mutate(p=fcc_tab$pdef) %>%
  dplyr::filter(for2010/1000 >= 1000 & (is.na(Mean) | (CI_low * CI_high) <= 0))
ascii(df_sign)
#+end_src

#+RESULTS:
|    | area_cont | area_ctry        | area_name             | area_code |     for2010 |  Mean |   Sd | CI_low | CI_high |     P |    p |
|----+-----------+------------------+-----------------------+-----------+-------------+-------+------+--------+---------+-------+------|
|  1 | America   | Brazil           | Brazil – Amapa        | AP        | 11564911.00 | -0.13 | 0.10 |  -0.35 |    0.07 | 12.00 | 0.10 |
|  2 | America   | Brazil           | Brazil – Minas Gerais | MG        |  1277155.00 | -0.15 | 0.09 |  -0.32 |    0.03 |  7.00 | 2.90 |
|  3 | America   | Brazil           | Brazil – Tocantins    | TO        |  1341400.00 | -0.04 | 0.09 |  -0.19 |    0.15 |  2.00 | 3.40 |
|  4 | America   | Costa Rica       | Costa Rica            | CRI       |  2276723.00 |       |      |        |         |       | 0.70 |
|  5 | America   | Cuba             | Cuba                  | CUB       |  1297060.00 |       |      |        |         |       | 1.10 |
|  6 | America   | Nicaragua        | Nicaragua             | NIC       |  4262376.00 |       |      |        |         |       | 2.20 |
|  7 | America   | Paraguay         | Paraguay              | PRY       |  1439852.00 |       |      |        |         |       | 2.70 |
|  8 | America   | Suriname         | Suriname              | SUR       | 13727213.00 | -0.05 | 0.13 |  -0.31 |    0.22 |  3.00 | 0.10 |
|  9 | Africa    | Angola           | Angola                | AGO       |  6044153.00 |       |      |        |         |       | 1.20 |
| 10 | Africa    | CAR              | CAR                   | CAF       |  9324998.00 | -0.09 | 0.11 |  -0.33 |    0.12 |  5.00 | 0.50 |
| 11 | Africa    | Eq. Guinea       | Eq. Guinea            | GNQ       |  2641579.00 | -0.14 | 0.14 |  -0.39 |    0.15 | 10.00 | 0.10 |
| 12 | Africa    | Ethiopia         | Ethiopia              | ETH       |  2824446.00 | -0.08 | 0.08 |  -0.24 |    0.08 |  5.00 | 2.40 |
| 13 | Africa    | Gabon            | Gabon                 | GAB       | 24101266.00 | -0.16 | 0.13 |  -0.41 |    0.09 | 14.00 | 0.00 |
| 14 | Africa    | Ivory Coast      | Ivory Coast           | CIV       |  6299445.00 |       |      |        |         |       | 4.60 |
| 15 | Africa    | Nigeria          | Nigeria               | NGA       |  7213732.00 |       |      |        |         |       | 1.50 |
| 16 | Asia      | Bhutan           | Bhutan                | BTN       |  1872066.00 |       |      |        |         |       | 0.40 |
| 17 | Asia      | Papua New Guinea | Papua New Guinea      | PNG       | 39791231.00 |       |      |        |         |       | 0.10 |
| 18 | Asia      | Solomon Isl.     | Solomon Isl.          | SLB       |  2757047.00 |       |      |        |         |       | 0.10 |

#+begin_src R :results output raw :exports none
df <- read_csv(here("Analysis/jrc2020/parea_estimates.csv"))
df <- df %>%
  dplyr::filter(for2010/1000 >= 1000 & !is.na(Mean) & (CI_low * CI_high) > 0) %>%
  dplyr::summarise(n=n(), mean=mean(P), sd=sd(P), min=min(P), max=max(P))
ascii(df)
#+end_src

#+RESULTS:
|   |     n |  mean |    sd |  min |   max |
|---+-------+-------+-------+------+-------|
| 1 | 47.00 | 30.62 | 18.72 | 5.00 | 82.00 |

*** Computations                                                   :ignore:

#+begin_src R :results output :exports none
## Effect of roads at decreasing deforestation probability
alpha_normalized <- -2.099
coef_road_km <- -0.017 # Back-transformed parameter to have slope in km^-1
theta_mean <- inv_logit(alpha_normalized) # Mean deforestation probability
theta_road_1km <- inv_logit(alpha_normalized + coef_road_km)
d_road_1km <- 100 * round(1 - (theta_road_1km / theta_mean), 2)
theta_road_10km <- inv_logit(alpha_normalized + coef_road_km * 10)
d_road_10km <- 100 * round(1 - (theta_road_10km / theta_mean), 2)
print(glue("A distance to road of 1km reduces deforestation by {d_road_1km}%."))
print(glue("A distance to road of 10km reduces deforestation by {d_road_10km}%."))
#+end_src

#+RESULTS:
: A distance to road of 1km reduces deforestation by 2%.
: A distance to road of 10km reduces deforestation by 14%.

#+begin_src R :results output :exports none
## Effect of edges at decreasing deforestation probability
alpha_normalized <- -2.099
coef_edge_km <- -2.472 # Back-transformed parameter to have slope in km^-1
theta_mean <- inv_logit(alpha_normalized) # Mean deforestation probability
theta_edge_1km <- inv_logit(alpha_normalized + coef_edge_km)
d_edge_1km <- 100*round(1-(theta_edge_1km/theta_mean), 2)
theta_edge_10km <- inv_logit(alpha_normalized + coef_edge_km*10)
d_edge_10km <- 100*round(1-(theta_edge_10km/theta_mean), 2)
print(glue("A distance to forest edge of 1km reduces deforestation by {d_edge_1km}%."))
print(glue("A distance to forest edge of 10km reduces deforestation by {d_edge_10km}%."))
#+end_src

#+RESULTS:
: A distance to forest edge of 1km reduces deforestation by 91%.
: A distance to forest edge of 10km reduces deforestation by 100%.

*** Computations                                                   :ignore:

#+NAME: fcc-hist
#+begin_src R :results output raw :exports none
df_mean <- read_csv(here("Analysis", "jrc2020", "fcc_hist_region_mean.csv")) %>% mutate(sim="mean")
df_min <- read_csv(here("Analysis", "jrc2020", "fcc_hist_region_min.csv")) %>% mutate(sim="min")
df_max <- read_csv(here("Analysis", "jrc2020", "fcc_hist_region_max.csv")) %>% mutate(sim="max")
df <- df_mean %>%
  dplyr::bind_rows(df_min, df_max) %>%
  dplyr::filter(area_cont %in% c("America", "Africa", "Asia", "All continents")) %>%
  dplyr::arrange(factor(area_cont, levels=c("America", "Africa", "Asia", "All continents")),
                 factor(sim, levels=c("min", "mean", "max"))) %>%
  dplyr::select(area_cont, for2000, for2010, for2020, andef, pdef, for2100, loss21, yrdis, sim)
ascii(df, include.rownames=FALSE)
#+end_src

#+RESULTS: fcc-hist
| area_cont      |       for2000 |       for2010 |       for2020 |      andef | pdef |      for2100 | loss21 |   yrdis | sim  |
|----------------+---------------+---------------+---------------+------------+------+--------------+--------+---------+------|
| America        |  687338828.00 |  646684903.00 |  621229023.00 | 1836098.00 | 0.30 | 476194555.00 |  30.72 | 6215.00 | min  |
| America        |  687338828.00 |  646684903.00 |  621229023.00 | 2545400.00 | 0.40 | 427790431.00 |  37.76 | 5394.00 | mean |
| America        |  687338828.00 |  646684903.00 |  621229023.00 | 3254695.00 | 0.50 | 380806415.00 |  44.60 | 4842.00 | max  |
| Africa         |  274993405.00 |  258401297.00 |  239681325.00 | 1315897.00 | 0.50 | 151415462.00 |  44.94 | 5069.00 | min  |
| Africa         |  274993405.00 |  258401297.00 |  239681325.00 | 1871233.00 | 0.70 | 129045039.00 |  53.07 | 4088.00 | mean |
| Africa         |  274993405.00 |  258401297.00 |  239681325.00 | 2426569.00 | 1.00 | 110050172.00 |  59.98 | 3585.00 | max  |
| Asia           |  297089526.00 |  268058087.00 |  248035053.00 | 1371294.00 | 0.50 | 142358155.00 |  52.08 | 6520.00 | min  |
| Asia           |  297089526.00 |  268058087.00 |  248035053.00 | 2001803.00 | 0.80 |  98921850.00 |  66.70 | 4062.00 | mean |
| Asia           |  297089526.00 |  268058087.00 |  248035053.00 | 2632313.00 | 1.00 |  62898467.00 |  78.83 | 3339.00 | max  |
| All continents | 1259421759.00 | 1173144287.00 | 1108945401.00 | 4523289.00 | 0.40 | 769968172.00 |  38.86 | 6520.00 | min  |
| All continents | 1259421759.00 | 1173144287.00 | 1108945401.00 | 6418436.00 | 0.60 | 655757320.00 |  47.93 | 5394.00 | mean |
| All continents | 1259421759.00 | 1173144287.00 | 1108945401.00 | 8313577.00 | 0.70 | 553755054.00 |  56.03 | 4842.00 | max  |

#+begin_src R :results output raw :exports none
# Summary of fcc loss a the country level
df <- read_csv(here("Manuscript/Supplementary_Materials/tables/forest_cover_change_mean.csv"))
ctry <- df %>%
  dplyr::mutate(loss21=round(100*(for2000-for2100)/for2000)) %>%
  dplyr::filter(loss21 == 100) %>%
  dplyr::mutate(fc1M=ifelse(for2000 >= 1e6, "+", "-")) %>%
  dplyr::arrange(area_cont, area_ctry)
ascii(ctry %>% dplyr::select(area_cont, area_ctry, area_name, for2000, loss21, yrdis, fc1M))
#+end_src

#+RESULTS:
|    | area_cont | area_ctry      | area_name                    |     for2000 | loss21 |   yrdis | fc1M |
|----+-----------+----------------+------------------------------+-------------+--------+---------+------|
|  1 | Africa    | Angola         | Angola                       |  7064733.00 | 100.00 | 2095.00 | +    |
|  2 | Africa    | Benin          | Benin                        |    76776.00 | 100.00 | 2041.00 | -    |
|  3 | Africa    | Burundi        | Burundi                      |   104249.00 | 100.00 | 2084.00 | -    |
|  4 | Africa    | Ethiopia       | Ethiopia                     |  3799018.00 | 100.00 | 2056.00 | +    |
|  5 | Africa    | Gambia         | Gambia                       |    49362.00 | 100.00 | 2074.00 | -    |
|  6 | Africa    | Ghana          | Ghana                        |  4931885.00 | 100.00 | 2050.00 | +    |
|  7 | Africa    | Guinea         | Guinea                       |  1895309.00 | 100.00 | 2042.00 | +    |
|  8 | Africa    | Guinea Bissau  | Guinea Bissau                |   398114.00 | 100.00 | 2073.00 | -    |
|  9 | Africa    | Ivory Coast    | Ivory Coast                  |  7733912.00 | 100.00 | 2036.00 | +    |
| 10 | Africa    | Kenya          | Kenya                        |  1199041.00 | 100.00 | 2082.00 | +    |
| 11 | Africa    | Madagascar     | Madagascar                   |  7024045.00 | 100.00 | 2067.00 | +    |
| 12 | Africa    | Malawi         | Malawi                       |   113422.00 | 100.00 | 2032.00 | -    |
| 13 | Africa    | Mayotte        | Mayotte                      |    17931.00 | 100.00 | 2043.00 | -    |
| 14 | Africa    | Nigeria        | Nigeria                      |  7770147.00 | 100.00 | 2080.00 | +    |
| 15 | Africa    | Rwanda         | Rwanda                       |   283986.00 | 100.00 | 2066.00 | -    |
| 16 | Africa    | Senegal        | Senegal                      |   136279.00 | 100.00 | 2082.00 | -    |
| 17 | Africa    | Sierra Leone   | Sierra Leone                 |  3440270.00 | 100.00 | 2036.00 | +    |
| 18 | Africa    | South Sudan    | South Sudan                  |   265213.00 | 100.00 | 2067.00 | -    |
| 19 | Africa    | Togo           | Togo                         |   159791.00 | 100.00 | 2037.00 | -    |
| 20 | Africa    | Uganda         | Uganda                       |  1878962.00 | 100.00 | 2043.00 | +    |
| 21 | Africa    | Zambia         | Zambia                       |   177005.00 | 100.00 | 2044.00 | -    |
| 22 | America   | Antigua and B. | Antigua and B.               |     4055.00 | 100.00 | 2078.00 | -    |
| 23 | America   | Bahamas        | Bahamas                      |   152350.00 | 100.00 | 2079.00 | -    |
| 24 | America   | Barbados       | Barbados                     |     4449.00 | 100.00 | 2072.00 | -    |
| 25 | America   | Brazil         | Brazil – Alagoas             |   111761.00 | 100.00 | 2060.00 | -    |
| 26 | America   | Brazil         | Brazil – Ceara               |    56712.00 | 100.00 | 2051.00 | -    |
| 27 | America   | Brazil         | Brazil – Espirito Santo      |   487268.00 | 100.00 | 2079.00 | -    |
| 28 | America   | Brazil         | Brazil – Goias               |   643704.00 | 100.00 | 2049.00 | -    |
| 29 | America   | Brazil         | Brazil – Maranhao            |  5638128.00 | 100.00 | 2068.00 | +    |
| 30 | America   | Brazil         | Brazil – Mato Grosso do Sul  |   871211.00 | 100.00 | 2077.00 | -    |
| 31 | America   | Brazil         | Brazil – Minas Gerais        |  1824088.00 | 100.00 | 2050.00 | +    |
| 32 | America   | Brazil         | Brazil – Paraiba             |    46097.00 | 100.00 | 2054.00 | -    |
| 33 | America   | Brazil         | Brazil – Pernambouco         |   137903.00 | 100.00 | 2063.00 | -    |
| 34 | America   | Brazil         | Brazil – Piaui               |   104472.00 | 100.00 | 2047.00 | -    |
| 35 | America   | Brazil         | Brazil – Rio de Janeiro      |   819541.00 | 100.00 | 2093.00 | -    |
| 36 | America   | Brazil         | Brazil – Rio Grande do Norte |    30540.00 | 100.00 | 2051.00 | -    |
| 37 | America   | Brazil         | Brazil – Sergipe             |    73520.00 | 100.00 | 2055.00 | -    |
| 38 | America   | Brazil         | Brazil – Tocantins           |  1730508.00 | 100.00 | 2045.00 | +    |
| 39 | America   | Dominican Rep. | Dominican Rep.               |  1254328.00 | 100.00 | 2091.00 | +    |
| 40 | America   | El Salvador    | El Salvador                  |   128663.00 | 100.00 | 2099.00 | -    |
| 41 | America   | Grenada        | Grenada                      |    25671.00 | 100.00 | 2092.00 | -    |
| 42 | America   | Guatemala      | Guatemala                    |  3449029.00 | 100.00 | 2073.00 | +    |
| 43 | America   | Haiti          | Haiti                        |   247385.00 | 100.00 | 2050.00 | -    |
| 44 | America   | Honduras       | Honduras                     |  3384398.00 | 100.00 | 2080.00 | +    |
| 45 | America   | Mexico         | Mexico                       |  9098171.00 | 100.00 | 2075.00 | +    |
| 46 | America   | Nicaragua      | Nicaragua                    |  4926475.00 | 100.00 | 2059.00 | +    |
| 47 | America   | Paraguay       | Paraguay                     |  2358900.00 | 100.00 | 2051.00 | +    |
| 48 | America   | Saint Martin   | Saint Martin                 |      728.00 | 100.00 | 2033.00 | -    |
| 49 | America   | Sint Maarten   | Sint Maarten                 |      308.00 | 100.00 | 2031.00 | -    |
| 50 | America   | Virgin Isl. UK | Virgin Isl. UK               |     4010.00 | 100.00 | 2039.00 | -    |
| 51 | America   | Virgin Isl. US | Virgin Isl. US               |     9180.00 | 100.00 | 2068.00 | -    |
| 52 | Asia      | Cambodia       | Cambodia                     |  4804127.00 | 100.00 | 2044.00 | +    |
| 53 | Asia      | India          | India – West. Ghats          |  3144031.00 | 100.00 | 2067.00 | +    |
| 54 | Asia      | Laos           | Laos                         | 11607486.00 | 100.00 | 2080.00 | +    |
| 55 | Asia      | Timor-Leste    | Timor-Leste                  |   130695.00 | 100.00 | 2086.00 | -    |
| 56 | Asia      | Vietnam        | Vietnam                      | 10691887.00 | 100.00 | 2093.00 | +    |

#+begin_src R :results output raw :exports none
# Summary of fcc loss for countries with high forest cover in 2000
df <- read_csv(here("Manuscript/Supplementary_Materials/tables/forest_cover_change_mean.csv"))
ctry <- df %>%
  dplyr::mutate(loss21=round(100*(for2000-for2100)/for2000)) %>%
  dplyr::filter(loss21 == 100) %>%
  dplyr::mutate(fc1M=ifelse(for2000 >= 1e6, "+", "-")) %>%
  dplyr::filter(fc1M == "+") %>%
  dplyr::arrange(area_cont, area_ctry)
ascii(ctry %>% dplyr::select(area_cont, area_ctry, area_name, for2000, loss21, yrdis, fc1M))
#+end_src

#+RESULTS:
|    | area_cont | area_ctry      | area_name             |     for2000 | loss21 |   yrdis | fc1M |
|----+-----------+----------------+-----------------------+-------------+--------+---------+------|
|  1 | Africa    | Angola         | Angola                |  7064733.00 | 100.00 | 2095.00 | +    |
|  2 | Africa    | Ethiopia       | Ethiopia              |  3799018.00 | 100.00 | 2056.00 | +    |
|  3 | Africa    | Ghana          | Ghana                 |  4931885.00 | 100.00 | 2050.00 | +    |
|  4 | Africa    | Guinea         | Guinea                |  1895309.00 | 100.00 | 2042.00 | +    |
|  5 | Africa    | Ivory Coast    | Ivory Coast           |  7733912.00 | 100.00 | 2036.00 | +    |
|  6 | Africa    | Kenya          | Kenya                 |  1199041.00 | 100.00 | 2082.00 | +    |
|  7 | Africa    | Madagascar     | Madagascar            |  7024045.00 | 100.00 | 2067.00 | +    |
|  8 | Africa    | Nigeria        | Nigeria               |  7770147.00 | 100.00 | 2080.00 | +    |
|  9 | Africa    | Sierra Leone   | Sierra Leone          |  3440270.00 | 100.00 | 2036.00 | +    |
| 10 | Africa    | Uganda         | Uganda                |  1878962.00 | 100.00 | 2043.00 | +    |
| 11 | America   | Brazil         | Brazil – Maranhao     |  5638128.00 | 100.00 | 2068.00 | +    |
| 12 | America   | Brazil         | Brazil – Minas Gerais |  1824088.00 | 100.00 | 2050.00 | +    |
| 13 | America   | Brazil         | Brazil – Tocantins    |  1730508.00 | 100.00 | 2045.00 | +    |
| 14 | America   | Dominican Rep. | Dominican Rep.        |  1254328.00 | 100.00 | 2091.00 | +    |
| 15 | America   | Guatemala      | Guatemala             |  3449029.00 | 100.00 | 2073.00 | +    |
| 16 | America   | Honduras       | Honduras              |  3384398.00 | 100.00 | 2080.00 | +    |
| 17 | America   | Mexico         | Mexico                |  9098171.00 | 100.00 | 2075.00 | +    |
| 18 | America   | Nicaragua      | Nicaragua             |  4926475.00 | 100.00 | 2059.00 | +    |
| 19 | America   | Paraguay       | Paraguay              |  2358900.00 | 100.00 | 2051.00 | +    |
| 20 | Asia      | Cambodia       | Cambodia              |  4804127.00 | 100.00 | 2044.00 | +    |
| 21 | Asia      | India          | India – West. Ghats   |  3144031.00 | 100.00 | 2067.00 | +    |
| 22 | Asia      | Laos           | Laos                  | 11607486.00 | 100.00 | 2080.00 | +    |
| 23 | Asia      | Vietnam        | Vietnam               | 10691887.00 | 100.00 | 2093.00 | +    |

*** Computations                                                   :ignore:

#+begin_src R :results output raw :exports none
# Carbon emissions
df <- read_csv(here("Analysis", "jrc2020", "C_trend_mean_cci.csv"))
ascii(df, include.rownames=FALSE, digits=3)
#+end_src

#+RESULTS:
| area_cont      | T10_20 | T20_30 | T30_40 | T40_50 | T50_60 | T60_70 | T70_80 | T80_90 | T90_100 | T100_110 |
|----------------+--------+--------+--------+--------+--------+--------+--------+--------+---------+----------|
| Africa         |  0.129 |  0.150 |  0.164 |  0.154 |  0.148 |  0.148 |  0.151 |  0.149 |   0.149 |    0.146 |
| America        |  0.206 |  0.247 |  0.250 |  0.259 |  0.268 |  0.272 |  0.274 |  0.275 |   0.283 |    0.288 |
| Asia           |  0.096 |  0.107 |  0.119 |  0.128 |  0.135 |  0.146 |  0.156 |  0.156 |   0.159 |    0.155 |
| All continents |  0.432 |  0.504 |  0.533 |  0.541 |  0.551 |  0.566 |  0.581 |  0.581 |   0.590 |    0.589 |

#+begin_src R :results output raw :exports none
# Carbon emissions
df <- read_csv(here("Analysis", "jrc2020", "C_trend_mean_avitabile.csv"))
ascii(df, include.rownames=FALSE, digits=3)
#+end_src

#+RESULTS:
| area_cont      | T10_20 | T20_30 | T30_40 | T40_50 | T50_60 | T60_70 | T70_80 | T80_90 | T90_100 | T100_110 |
|----------------+--------+--------+--------+--------+--------+--------+--------+--------+---------+----------|
| Africa         |  0.105 |  0.114 |  0.136 |  0.136 |  0.134 |  0.134 |  0.139 |  0.144 |   0.151 |    0.151 |
| America        |  0.194 |  0.202 |  0.197 |  0.203 |  0.214 |  0.221 |  0.223 |  0.225 |   0.233 |    0.239 |
| Asia           |  0.167 |  0.154 |  0.179 |  0.198 |  0.214 |  0.235 |  0.251 |  0.243 |   0.244 |    0.223 |
| All continents |  0.467 |  0.471 |  0.512 |  0.536 |  0.562 |  0.590 |  0.612 |  0.612 |   0.628 |    0.613 |

#+begin_src R :results output raw :exports none
# Carbon emissions
df <- read_csv(here("Analysis", "jrc2020", "C_trend_mean_whrc.csv"))
ascii(df, include.rownames=FALSE, digits=3)
#+end_src

#+RESULTS:
| area_cont      | T10_20 | T20_30 | T30_40 | T40_50 | T50_60 | T60_70 | T70_80 | T80_90 | T90_100 | T100_110 |
|----------------+--------+--------+--------+--------+--------+--------+--------+--------+---------+----------|
| Africa         |  0.171 |  0.183 |  0.186 |  0.169 |  0.160 |  0.154 |  0.149 |  0.144 |   0.142 |    0.139 |
| America        |  0.228 |  0.239 |  0.235 |  0.237 |  0.240 |  0.236 |  0.234 |  0.227 |   0.232 |    0.235 |
| Asia           |  0.186 |  0.179 |  0.193 |  0.202 |  0.208 |  0.218 |  0.222 |  0.212 |   0.209 |    0.191 |
| All continents |  0.585 |  0.602 |  0.615 |  0.608 |  0.608 |  0.609 |  0.606 |  0.583 |   0.583 |    0.565 |

#+begin_src R :results output raw :exports none
# Summary of fcc loss for countries with high forest cover in 2000
df <- read_csv(here("Analysis", "jrc2020", "C_uptk.csv"))
ascii(df, include.rownames=FALSE, digits=3)
#+end_src

#+RESULTS:
| area_cont      |        for2000 |       for2100 | deltaC | sim  |   C_uptk_2000 |   C_uptk_2100 | C_uptk_loss |
|----------------+----------------+---------------+--------+------+---------------+---------------+-------------|
| America        |  687338828.000 | 476194555.000 |  0.470 | min  | 323049249.160 | 223811440.850 |       0.307 |
| America        |  687338828.000 | 427790431.000 |  0.470 | mean | 323049249.160 | 201061502.570 |       0.378 |
| America        |  687338828.000 | 380806415.000 |  0.470 | max  | 323049249.160 | 178979015.050 |       0.446 |
| Africa         |  274993405.000 | 151415462.000 |  0.611 | min  | 168020970.455 |  92514847.282 |       0.449 |
| Africa         |  274993405.000 | 129045039.000 |  0.611 | mean | 168020970.455 |  78846518.829 |       0.531 |
| Africa         |  274993405.000 | 110050172.000 |  0.611 | max  | 168020970.455 |  67240655.092 |       0.600 |
| Asia           |  297089526.000 | 142358155.000 |  0.329 | min  |  97742454.054 |  46835832.995 |       0.521 |
| Asia           |  297089526.000 |  98921850.000 |  0.329 | mean |  97742454.054 |  32545288.650 |       0.667 |
| Asia           |  297089526.000 |  62898467.000 |  0.329 | max  |  97742454.054 |  20693595.643 |       0.788 |
| All continents | 1259421759.000 | 553755054.000 |        | max  | 588812673.669 | 266913265.785 |       0.547 |
| All continents | 1259421759.000 | 655757320.000 |        | mean | 588812673.669 | 312453310.049 |       0.469 |
| All continents | 1259421759.000 | 769968172.000 |        | min  | 588812673.669 | 363162121.127 |       0.383 |

#+begin_src R :results output raw :exports none
# Summary of fcc loss a the country level
df <- read_csv(here("Manuscript/Supplementary_Materials/tables/forest_cover_change_mean.csv"))
# Asia
asia <- df %>%
  dplyr::mutate(loss21=round(100*(for2000-for2100)/for2000)) %>%
  dplyr::filter(area_cont == "Asia") %>%
  dplyr::select(area_ctry, area_name, d_mean, yrdis, loss21)
# Selected countries in Asia
ctry <- asia %>%
  dplyr::filter(yrdis >= 2070 & yrdis <=2110)
ascii(ctry)
#+end_src

#+RESULTS:
|   | area_ctry   | area_name   |    d_mean |   yrdis | loss21 |
|---+-------------+-------------+-----------+---------+--------|
| 1 | Laos        | Laos        | 138221.00 | 2080.00 | 100.00 |
| 2 | Myanmar     | Myanmar     | 165195.00 | 2103.00 |  97.00 |
| 3 | Timor-Leste | Timor-Leste |   1173.00 | 2086.00 | 100.00 |
| 4 | Vietnam     | Vietnam     | 102909.00 | 2093.00 | 100.00 |

#+begin_src R :results output :exports none
# Deforestation
d_asia <- sum(asia$d_mean)
d_ctry <- sum(ctry$d_mean)
perc <- round(100 * d_ctry / d_asia, 2)
print(glue("d_asia: {d_asia} ha/yr, d_ctry: {d_ctry} ha/yr, perc: {perc}%"))
#+end_src

#+RESULTS:
: d_asia: 2001803 ha/yr, d_ctry: 407498 ha/yr, perc: 20.36%

*** Computations                                                   :ignore:

#+begin_src R :results output :exports none
# Deforestation scenarios
l <- 4523289; m <- 6418436; h <- 8313577
dec <- round(100 * (l - m)/m); inc <- round(100 * (h - m)/m)
print(glue("Decrease: {dec}%, Increase: {inc}%"))
#+end_src

#+RESULTS:
: Decrease: -30%, Increase: 30%

#+begin_src R :results output raw :exports none
# Carbon emmissions with high deforestation
df <- read_csv(here("Analysis", "jrc2020", "C_trend_max_cci.csv"))
ascii(df, include.rownames=FALSE, digits=3)
#+end_src

#+RESULTS:
| area_cont      | T10_20 | T20_30 | T30_40 | T40_50 | T50_60 | T60_70 | T70_80 | T80_90 | T90_100 | T100_110 |
|----------------+--------+--------+--------+--------+--------+--------+--------+--------+---------+----------|
| Africa         |  0.129 |  0.196 |  0.203 |  0.182 |  0.182 |  0.184 |  0.182 |  0.179 |   0.179 |    0.179 |
| America        |  0.206 |  0.313 |  0.321 |  0.333 |  0.342 |  0.347 |  0.350 |  0.365 |   0.379 |    0.379 |
| Asia           |  0.096 |  0.142 |  0.163 |  0.174 |  0.193 |  0.208 |  0.210 |  0.204 |   0.192 |    0.164 |
| All continents |  0.432 |  0.651 |  0.687 |  0.690 |  0.717 |  0.739 |  0.742 |  0.748 |   0.749 |    0.722 |

#+begin_src R :results output :exports none
# Percentage of land cover
land <- 14893.91 * 1e6  # https://en.wikipedia.org/wiki/Land
for2000 <- 1259421759.00; for2100_m <- 655757320.00; for2100_h <- 553755054.00
p_2000 <- round(100 * for2000 / land, 1)
p_m <- round(100 * for2100_m / land, 1)
p_h <- round(100 * for2100_h / land, 1)
print(glue("Percentage of emerged land, in 2000: {p_2000}%, 2100 mean defor: {p_m}%, 2100 high defor: {p_h}%"))
#+end_src

#+RESULTS:
: Percentage of emerged land, in 2000: 8.5%, 2100 mean defor: 4.4%, 2100 high defor: 3.7%

#+begin_src R :results output raw :exports none
# Projections by Cramer et al. 2004 RSTB
df <- data.frame(cont=c("America", "Africa", "Asia", "total"),
                 for1990=c(8070, 3980, 2740, 14790),
                 d_low=c(22, 7, 20, 49),
                 d_high=c(56.9, 37, 35.1, 129),
                 for2100_low=c(4920, 2150, 430, 7490),
                 for2100_high=c(2070, 650, 20, 2740))
df <- df |>
  dplyr::mutate(d_mean=(d_low + d_high) / 2) |>
  dplyr::mutate(for2000=for1990 - 10 * d_mean) |>
  dplyr::mutate(loss_low=round(100 * (for2000 - for2100_low) / for2000),
                loss_high=round(100 * (for2000 - for2100_high) / for2000))
ascii(df, include.rownames=FALSE, digits=0)
#+end_src

#+RESULTS:
| cont    | for1990 | d_low | d_high | for2100_low | for2100_high | d_mean | for2000 | loss_low | loss_high |
|---------+---------+-------+--------+-------------+--------------+--------+---------+----------+-----------|
| America |    8070 |    22 |     57 |        4920 |         2070 |     39 |    7676 |       36 |        73 |
| Africa  |    3980 |     7 |     37 |        2150 |          650 |     22 |    3760 |       43 |        83 |
| Asia    |    2740 |    20 |     35 |         430 |           20 |     28 |    2464 |       83 |        99 |
| total   |   14790 |    49 |    129 |        7490 |         2740 |     89 |   13900 |       46 |        80 |

#+begin_src R :results output :exports none
# Projections by Soares-Filho et al. 2006 Nature
for2003 <- 5.30
for2050 <- 3.20
loss <- round(100 * (for2003 - for2050) / for2003)
print(loss)
#+end_src

#+RESULTS:
: [1] 40

** Table 1                                                          :ignore:

#+NAME: cap-fcc
#+begin_src org :results output latex :exports none
*Past and predicted changes in forest cover*. We provide past and predicted forest cover for the three continents and for the three countries with the highest forest cover in 2010 for each continent (Brazil in America, the DRC in Africa, and Indonesia in Asia). Past forest cover areas (in thousand hectares, Kha) refers to their status on January 1^{st} 2000, 2010, and 2020 ("fc2000", "fc2010", and "fc2020", respectively). We provide the mean annual deforested area $d$ (Kha/yr) for the last ten-year period from January 1^{st} 2010 to January 1^{st} 2020, and the corresponding mean annual deforestation rate $p$ (%/yr). Projected forest cover areas are given for the years 2050 and 2100 ("fc2050" and "fc2100"). Projections are based on the forest cover in 2020 ("fc2020") and the mean annual deforested area ($d$) assuming a business-as-usual scenario of deforestation. Column "loss21" indicates the projected percentage of forest cover loss during the 21^{st} century (2100 vs. 2000). We estimate the year ("yr75") at which 75% of the forest cover in 2000 will have disappeared.\label{tab:fcc}
#+end_src

#+NAME: txt-fcc
#+begin_src org :results output latex :exports none
We provide past and predicted forest cover for the three continents and for the three countries with the highest forest cover in 2010 for each continent (Brazil in America, the DRC in Africa, and Indonesia in Asia). Past forest cover areas (in thousand hectares, Kha) refers to their status on January 1^{st} 2000, 2010, and 2020 ("fc2000", "fc2010", and "fc2020", respectively). We provide the mean annual deforested area $d$ (Kha/yr) for the last ten-year period from January 1^{st} 2010 to January 1^{st} 2020, and the corresponding mean annual deforestation rate $p$ (%/yr). Projected forest cover areas are given for the years 2050 and 2100 ("fc2050" and "fc2100"). Projections are based on the forest cover in 2020 ("fc2020") and the mean annual deforested area ($d$) assuming a business-as-usual scenario of deforestation. Column "loss21" indicates the projected percentage of forest cover loss during the 21^{st} century (2100 vs. 2000). We estimate the year ("yr75") at which 75% of the forest cover in 2000 will have disappeared.
#+end_src

#+NAME: tab:fcc
#+begin_src R :results output latex :exports results :var cap=cap-fcc txt=txt-fcc
## Import data
df1 <- read_csv(here("Manuscript/Org-mode/tables/fcc_hist_region_mean.csv"))
df2 <- read_csv(here("Manuscript/Org-mode/tables/fcc_proj_region_mean.csv"))
## Arrange data
df <- df1 %>%
  dplyr::select(area_cont, for2000, for2010, for2020, andef, pdef) %>%
  dplyr::bind_cols(df2) %>%
  dplyr::filter(area_cont!="India") %>%
  dplyr::select(area_cont, for2000, for2010, for2020, andef, pdef,
                for2050, for2100, loss21, yr75dis) %>%
  dplyr::mutate(andef=round(andef/1000), yr75dis=as.character(yr75dis),
                loss21=round(loss21)) %>%
  dplyr::mutate(id=c(2,3,1,4:7)) %>% arrange(id) %>% select(-id) %>%
  dplyr::mutate(area_cont=ifelse(area_cont=="All continents", "All cont.", area_cont)) %>%
  dplyr::mutate_at(.var=vars(starts_with("for")),.fun=function(x){round(x/1000)})
## Make table
vect.align <- c(rep("l", 1), rep("r", 9))
unit.vect <- c("", "(Kha)", "(Kha)", "(Kha)", "(Kha/yr)", "(\\%/yr)", "(Kha)", "(Kha)", "(\\%)", "")
col.names <- c("Regions", "fc2000", "fc2010", "fc2020", "$d$", "$p$",
               "fc2050", "fc2100", "loss21", "yr75")
kable_tab <- knitr::kable(df, caption=cap, booktabs=TRUE, longtable=FALSE,
             format="latex",
             format.args=list(big.mark=","),
             escape=FALSE,
             col.names=unit.vect,
             align=vect.align, linesep="") %>%
  add_header_above(header=col.names, line=FALSE, escape=FALSE, align=vect.align) %>%
  pack_rows("Countries", 1, 3) %>%
  pack_rows("Continents", 4, 7) %>%
  kable_styling(latex_options=c("striped"),
    full_width=full_width_type,
    bootstrap_options = c("striped", "hover"),
    position="center",
    font_size=font_size_type,
    repeat_header_method="replace")

## Latex changes
latextab_2cols_text(kable_tab, txt)
#+end_src

#+RESULTS: tab:fcc
#+begin_export latex
\begin{table}[H]

\caption{\textbf{Past and predicted changes in forest cover}. We provide past and predicted forest cover for the three continents and for the three countries with the highest forest cover in 2010 for each continent (Brazil in America, the DRC in Africa, and Indonesia in Asia). Past forest cover areas (in thousand hectares, Kha) refers to their status on January 1\textsuperscript{st} 2000, 2010, and 2020 (``fc2000'', ``fc2010'', and ``fc2020'', respectively). We provide the mean annual deforested area \(d\) (Kha/yr) for the last ten-year period from January 1\textsuperscript{st} 2010 to January 1\textsuperscript{st} 2020, and the corresponding mean annual deforestation rate \(p\) (\%/yr). Projected forest cover areas are given for the years 2050 and 2100 (``fc2050'' and ``fc2100''). Projections are based on the forest cover in 2020 (``fc2020'') and the mean annual deforested area (\(d\)) assuming a business-as-usual scenario of deforestation. Column ``loss21'' indicates the projected percentage of forest cover loss during the 21\textsuperscript{st} century (2100 vs. 2000). We estimate the year (``yr75'') at which 75\% of the forest cover in 2000 will have disappeared.\label{tab:fcc}
}
\centering
\fontsize{9}{11}\selectfont
\begin{tabular}{lrrrrrrrrr}
\toprule
\multicolumn{1}{l}{Regions} & \multicolumn{1}{r}{fc2000} & \multicolumn{1}{r}{fc2010} & \multicolumn{1}{r}{fc2020} & \multicolumn{1}{r}{$d$} & \multicolumn{1}{r}{$p$} & \multicolumn{1}{r}{fc2050} & \multicolumn{1}{r}{fc2100} & \multicolumn{1}{r}{loss21} & \multicolumn{1}{r}{yr75} \\
 & (Kha) & (Kha) & (Kha) & (Kha/yr) & (\%/yr) & (Kha) & (Kha) & (\%) & \\
\midrule
\addlinespace[0.3em]
\multicolumn{10}{l}{\textbf{Countries}}\\
\cellcolor{gray!6}{\hspace{1em}Brazil} & \cellcolor{gray!6}{374,282} & \cellcolor{gray!6}{348,650} & \cellcolor{gray!6}{334,948} & \cellcolor{gray!6}{1,370} & \cellcolor{gray!6}{0.4} & \cellcolor{gray!6}{293,844} & \cellcolor{gray!6}{225,336} & \cellcolor{gray!6}{40} & \cellcolor{gray!6}{2204}\\
\hspace{1em}DRC & 131,298 & 125,605 & 118,283 & 732 & 0.6 & 96,318 & 59,711 & 55 & 2134\\
\cellcolor{gray!6}{\hspace{1em}Indonesia} & \cellcolor{gray!6}{139,358} & \cellcolor{gray!6}{126,473} & \cellcolor{gray!6}{117,072} & \cellcolor{gray!6}{940} & \cellcolor{gray!6}{0.8} & \cellcolor{gray!6}{88,876} & \cellcolor{gray!6}{41,883} & \cellcolor{gray!6}{70} & \cellcolor{gray!6}{2111}\\
\addlinespace[0.3em]
\multicolumn{10}{l}{\textbf{Continents}}\\
\hspace{1em}America & 687,339 & 646,685 & 621,229 & 2,545 & 0.4 & 544,869 & 427,790 & 38 & 2220\\
\cellcolor{gray!6}{\hspace{1em}Africa} & \cellcolor{gray!6}{274,993} & \cellcolor{gray!6}{258,401} & \cellcolor{gray!6}{239,681} & \cellcolor{gray!6}{1,871} & \cellcolor{gray!6}{0.7} & \cellcolor{gray!6}{188,403} & \cellcolor{gray!6}{129,045} & \cellcolor{gray!6}{53} & \cellcolor{gray!6}{2163}\\
\hspace{1em}Asia & 297,090 & 268,058 & 248,035 & 2,002 & 0.8 & 188,558 & 98,922 & 67 & 2117\\
\cellcolor{gray!6}{\hspace{1em}All cont.} & \cellcolor{gray!6}{1,259,422} & \cellcolor{gray!6}{1,173,144} & \cellcolor{gray!6}{1,108,945} & \cellcolor{gray!6}{6,418} & \cellcolor{gray!6}{0.6} & \cellcolor{gray!6}{921,830} & \cellcolor{gray!6}{655,757} & \cellcolor{gray!6}{48} & \cellcolor{gray!6}{2192}\\
\bottomrule
\end{tabular}
\end{table}
#+end_export

\newpage

